#include "Menu.h"
#include <iostream>
using namespace std;

void print_menu() {
    system("cls");
    cout << "+----------------------------------------------------------+\n";
    cout << "|  Приложение для подбора аналогов лекарственных средств!  |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << "|                       Основное меню                      |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << "|                        1. Войти                          |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << "|                   2. Зарегестрироваться                  |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << "|              3. Вывести всех пользователей               |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << "|                         4.Выход                          |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << ">>>";
}

int get_variant(int count) {
    int variant;
    cin >> variant;
    while (/*isalpha(variant) or */variant < 1 or variant > count) {
        cout << "Неправильный ввод данных. Попробуйте ещё." << endl;
        cout << ">>>";
        cin >> variant;
    }

    return variant;
}

void print_dop_menu() {
    system("cls");
    cout << "Отлично! Вы авторизованны!\n";
    cout << "+----------------------------------------------------------+\n";
    cout << "|  Приложение для подбора аналогов лекарственных средств!  |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << "|                     1. Найти аналог                      |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << "|        2. Добавить новое лекарство и его аналог          |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << "|               3. Вывести всю базу данных                 |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << "|                         4.Выход                          |\n";
    cout << "+----------------------------------------------------------+\n";
    cout << ">>>";
}
